/**
---------------------------------------------------------------------------------------------------------------------------------------------
 * @file        : tim.h
 * @brief       : Заголовочный файл для инициализации таймеров TIM1 и TIM2
 * @author      : xmatech
 * @date        : 16.01.2025
 * @board       : JZ-F407VET6
 * @MCU         : STM32F407VET6
 * @IDE         : Segger Embedded Studio
 *
 * @Description : Инициализация TIM1 в режиме захвата входа для измерения времени.
 *                Инициализация TIM2 для генерации частоты 1 кГц.
 *                Объявление глобальных переменных для хранения времени.
---------------------------------------------------------------------------------------------------------------------------------------------
*/


#define ROUND_TO_ONE_DECIMAL(x) ((int)((x) * 10) / 10.0f)

// Объявление глобальных переменных для отслеживания времени
extern volatile float capture_s;  // интервал между нажатиями S1 и S2 в секундах
extern volatile float capture_ms; // интервал между нажатиями S1 и S2 в милисекундах


void tim1_init(void);
void tim2_init(void);
