/**
----------------------------------------------------------------------------------------------
 * @file        : systick.c
 * @brief       : Обработчик прерывания SysTick.
 * @author      : xmatech
 * @date        : 14.01.2025
 * @board       : JZ-F407VET6
 * @MCU         : STM32F407VET6: 
 * @IDE         : Segger Embedded StudioDE     
 * 
 * @Description : Вызывается каждые 1 мс для увеличения глобального счетчика времени на 1 мс.
                  Прерывание SysTick используется для точного отсчета времени с шагом 1 мс.
----------------------------------------------------------------------------------------------
 */               

#include "main.h"
void SysTick_Handler(void) {
    time_ms++;  // Увеличение счетчика времени на 1 мс
}
