/**
---------------------------------------------------------------------------------------------------------------------------------------------
 * @file        : tim.h
 * @brief       : Заголовочный файл для инициализации таймера TIM1.
 * @author      : xmatech
 * @date        : 14.01.2025
 * @board       : JZ-F407VET6
 * @MCU         : STM32F407VET6
 * @IDE         : Segger Embedded Studio
 *
 * @Description : Данный файл содержит объявление функции для инициализации таймера TIM1,
 *                который используется для генерации ШИМ-сигнала на канале 4 (PE14).
---------------------------------------------------------------------------------------------------------------------------------------------
*/

/**
 * @brief Инициализация таймера TIM1.
 */
void tim1_init(void);  // Инициализация таймера TIM1