/*--------------------------------------------------------------------------------
 * @file        : spi_init.h
 * @brief       : Заголовочный файл для инициализации и настройки модуля SPI2.
 * @author      : xmatech
 * @date        : 13.01.2025
 * @board       : JZ-F407VET6
 * @MCU         : STM32F407VET6
 * @IDE         : Segger Embedded Studio
 ----------------------------------------------------------------------------------
 */

/**
 * @brief Прототип функции для инициализации SPI2.
 * 
 * Функция настраивает SPI2 для работы в режиме Master с частотой 1,32 МГц.
 */
void spi2_init(void); 